/**
 * Created by toonew on 2015/8/24.
 */
(function(){

    //(21,94) 定义了一些函数的变量和函数 jQuery=function(){};

    //(96 283）给jQ对象，添加了一些方法和属性

    //(285,347) jQ的对象的继承方法

    //(349,817) 扩展一些工具方法

    //(877,2856) Sizzle：复杂选择器的实现

    //(2885,3042) Callbacks ：回调对象：函数的一个同一管理

    //(3050,3190) Deferred：延迟对象：对异步的同一管理

    //(3093,3304) support：功能判断

    //(3322,3634)  Data():  数据缓存

    //(3636,3809)  queue:  队列管理

    //(3810,4313)  attr()  prop()  val()  addClass()等：对元素属性的操作

    //(4316,5145)  on()  trigger()  ：事件操作的相关方法

    //(5147,6077)  DOM操作： 添加   删除    获取  包装   DOM删选

    //(6080,6643)  css() ：样式的操作

    //(6646,7880)  提交的属性和AJax( )的功能： ajax() load() getJson();

    //(7883,8604)  animate（）：运动的方法

    //(8608,8823)  offset()  ：位置和尺寸的方法

    //(8836,8852)  JQ支持模块化的模式

    //(8826) window.jQuery=window.$=jQuery;


});